luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSent_reg.h
/** \brief  2EC, Interrupt Enable Register */
#define SENT_CH7_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00032ECu)

/** Alias (User Manual Name) for SENT_CH7_INTEN.
* To use register names with standard convension, please use SENT_CH7_INTEN.
*/
#define	SENT_INTEN7	(SENT_CH7_INTEN)

/** \brief  2E4, Interrupt Set Register */
#define SENT_CH7_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00032E4u)

/** Alias (User Manual Name) for SENT_CH7_INTSET.
* To use register names with standard convension, please use SENT_CH7_INTSET.
*/
#define	SENT_INTSET7	(SENT_CH7_INTSET)

/** \brief  2E0, Interrupt Status Register */
#define SENT_CH7_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00032E0u)

/** Alias (User Manual Name) for SENT_CH7_INTSTAT.
* To use register names with standard convension, please use SENT_CH7_INTSTAT.
*/
#define	SENT_INTSTAT7	(SENT_CH7_INTSTAT)

/** \brief  2D4, Input and Output Control Register */
#define SENT_CH7_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00032D4u)

/** Alias (User Manual Name) for SENT_CH7_IOCR.
* To use register names with standard convension, please use SENT_CH7_IOCR.
*/
#define	SENT_IOCR7	(SENT_CH7_IOCR)

/** \brief  2C8, Receiver Control Register */
#define SENT_CH7_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00032C8u)

/** Alias (User Manual Name) for SENT_CH7_RCR.
* To use register names with standard convension, please use SENT_CH7_RCR.
*/
#define	SENT_RCR7	(SENT_CH7_RCR)

/** \brief  2CC, Receive Status Register */
#define SENT_CH7_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00032CCu)

/** Alias (User Manual Name) for SENT_CH7_RSR.
* To use register names with standard convension, please use SENT_CH7_RSR.
*/
#define	SENT_RSR7	(SENT_CH7_RSR)

/** \brief  2D8, SPC Control Register */
#define SENT_CH7_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00032D8u)

/** Alias (User Manual Name) for SENT_CH7_SCR.
* To use register names with standard convension, please use SENT_CH7_SCR.
*/
#define	SENT_SCR7	(SENT_CH7_SCR)

/** \brief  2D0, Serial Data and Status Register */
#define SENT_CH7_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00032D0u)

/** Alias (User Manual Name) for SENT_CH7_SDS.
* To use register names with standard convension, please use SENT_CH7_SDS.
*/
#define	SENT_SDS7	(SENT_CH7_SDS)

/** \brief  2DC, Receive Data View Register */
#define SENT_CH7_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00032DCu)

/** Alias (User Manual Name) for SENT_CH7_VIEW.
* To use register names with standard convension, please use SENT_CH7_VIEW.
*/
#define	SENT_VIEW7	(SENT_CH7_VIEW)

/** \brief  2F4, Watch Dog Timer Register */
#define SENT_CH7_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00032F4u)

/** Alias (User Manual Name) for SENT_CH7_WDT.
* To use register names with standard convension, please use SENT_CH7_WDT.
*/
#define	SENT_WDT7	(SENT_CH7_WDT)

/** \brief  304, Channel Fractional Divider Register */
#define SENT_CH8_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003304u)

/** Alias (User Manual Name) for SENT_CH8_CFDR.
* To use register names with standard convension, please use SENT_CH8_CFDR.
*/
#define	SENT_CFDR8	(SENT_CH8_CFDR)

/** \brief  300, Channel Pre Divider Register */
#define SENT_CH8_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003300u)

/** Alias (User Manual Name) for SENT_CH8_CPDR.
* To use register names with standard convension, please use SENT_CH8_CPDR.
*/
#define	SENT_CPDR8	(SENT_CH8_CPDR)

/** \brief  330, Interrupt Node Pointer Register */
#define SENT_CH8_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003330u)

/** Alias (User Manual Name) for SENT_CH8_INP.
* To use register names with standard convension, please use SENT_CH8_INP.
*/
#define	SENT_INP8	(SENT_CH8_INP)

/** \brief  328, Interrupt Clear Register */
#define SENT_CH8_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003328u)

/** Alias (User Manual Name) for SENT_CH8_INTCLR.
* To use register names with standard convension, please use SENT_CH8_INTCLR.
*/
#define	SENT_INTCLR8	(SENT_CH8_INTCLR)

/** \brief  32C, Interrupt Enable Register */
#define SENT_CH8_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000332Cu)

/** Alias (User Manual Name) for SENT_CH8_INTEN.
* To use register names with standard convension, please use SENT_CH8_INTEN.
*/
#define	SENT_INTEN8	(SENT_CH8_INTEN)

/** \brief  324, Interrupt Set Register */
#define SENT_CH8_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003324u)

/** Alias (User Manual Name) for SENT_CH8_INTSET.
* To use register names with standard convension, please use SENT_CH8_INTSET.
*/
#define	SENT_INTSET8	(SENT_CH8_INTSET)

/** \brief  320, Interrupt Status Register */
#define SENT_CH8_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003320u)

/** Alias (User Manual Name) for SENT_CH8_INTSTAT.
* To use register names with standard convension, please use SENT_CH8_INTSTAT.
*/
#define	SENT_INTSTAT8	(SENT_CH8_INTSTAT)

/** \brief  314, Input and Output Control Register */
#define SENT_CH8_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003314u)

/** Alias (User Manual Name) for SENT_CH8_IOCR.
* To use register names with standard convension, please use SENT_CH8_IOCR.
*/
#define	SENT_IOCR8	(SENT_CH8_IOCR)

/** \brief  308, Receiver Control Register */
#define SENT_CH8_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003308u)

/** Alias (User Manual Name) for SENT_CH8_RCR.
* To use register names with standard convension, please use SENT_CH8_RCR.
*/
#define	SENT_RCR8	(SENT_CH8_RCR)

/** \brief  30C, Receive Status Register */
#define SENT_CH8_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000330Cu)

/** Alias (User Manual Name) for SENT_CH8_RSR.
* To use register names with standard convension, please use SENT_CH8_RSR.
*/
#define	SENT_RSR8	(SENT_CH8_RSR)

/** \brief  318, SPC Control Register */
#define SENT_CH8_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003318u)

/** Alias (User Manual Name) for SENT_CH8_SCR.
* To use register names with standard convension, please use SENT_CH8_SCR.
*/
#define	SENT_SCR8	(SENT_CH8_SCR)

/** \brief  310, Serial Data and Status Register */
#define SENT_CH8_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003310u)

/** Alias (User Manual Name) for SENT_CH8_SDS.
* To use register names with standard convension, please use SENT_CH8_SDS.
*/
#define	SENT_SDS8	(SENT_CH8_SDS)

/** \brief  31C, Receive Data View Register */
#define SENT_CH8_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000331Cu)

