luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH8_VIEW.
* To use register names with standard convension, please use SENT_CH8_VIEW.
*/
#define	SENT_VIEW8	(SENT_CH8_VIEW)

/** \brief  334, Watch Dog Timer Register */
#define SENT_CH8_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003334u)

/** Alias (User Manual Name) for SENT_CH8_WDT.
* To use register names with standard convension, please use SENT_CH8_WDT.
*/
#define	SENT_WDT8	(SENT_CH8_WDT)

/** \brief  344, Channel Fractional Divider Register */
#define SENT_CH9_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003344u)

/** Alias (User Manual Name) for SENT_CH9_CFDR.
* To use register names with standard convension, please use SENT_CH9_CFDR.
*/
#define	SENT_CFDR9	(SENT_CH9_CFDR)

/** \brief  340, Channel Pre Divider Register */
#define SENT_CH9_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003340u)

/** Alias (User Manual Name) for SENT_CH9_CPDR.
* To use register names with standard convension, please use SENT_CH9_CPDR.
*/
#define	SENT_CPDR9	(SENT_CH9_CPDR)

/** \brief  370, Interrupt Node Pointer Register */
#define SENT_CH9_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003370u)

/** Alias (User Manual Name) for SENT_CH9_INP.
* To use register names with standard convension, please use SENT_CH9_INP.
*/
#define	SENT_INP9	(SENT_CH9_INP)

/** \brief  368, Interrupt Clear Register */
#define SENT_CH9_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003368u)

/** Alias (User Manual Name) for SENT_CH9_INTCLR.
* To use register names with standard convension, please use SENT_CH9_INTCLR.
*/
#define	SENT_INTCLR9	(SENT_CH9_INTCLR)

/** \brief  36C, Interrupt Enable Register */
#define SENT_CH9_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000336Cu)

/** Alias (User Manual Name) for SENT_CH9_INTEN.
* To use register names with standard convension, please use SENT_CH9_INTEN.
*/
#define	SENT_INTEN9	(SENT_CH9_INTEN)

/** \brief  364, Interrupt Set Register */
#define SENT_CH9_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003364u)

/** Alias (User Manual Name) for SENT_CH9_INTSET.
* To use register names with standard convension, please use SENT_CH9_INTSET.
*/
#define	SENT_INTSET9	(SENT_CH9_INTSET)

/** \brief  360, Interrupt Status Register */
#define SENT_CH9_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003360u)

/** Alias (User Manual Name) for SENT_CH9_INTSTAT.
* To use register names with standard convension, please use SENT_CH9_INTSTAT.
*/
#define	SENT_INTSTAT9	(SENT_CH9_INTSTAT)

/** \brief  354, Input and Output Control Register */
#define SENT_CH9_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003354u)

/** Alias (User Manual Name) for SENT_CH9_IOCR.
* To use register names with standard convension, please use SENT_CH9_IOCR.
*/
#define	SENT_IOCR9	(SENT_CH9_IOCR)

/** \brief  348, Receiver Control Register */
#define SENT_CH9_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003348u)

/** Alias (User Manual Name) for SENT_CH9_RCR.
* To use register names with standard convension, please use SENT_CH9_RCR.
*/
#define	SENT_RCR9	(SENT_CH9_RCR)

/** \brief  34C, Receive Status Register */
#define SENT_CH9_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000334Cu)

/** Alias (User Manual Name) for SENT_CH9_RSR.
* To use register names with standard convension, please use SENT_CH9_RSR.
*/
#define	SENT_RSR9	(SENT_CH9_RSR)

/** \brief  358, SPC Control Register */
#define SENT_CH9_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003358u)

/** Alias (User Manual Name) for SENT_CH9_SCR.
* To use register names with standard convension, please use SENT_CH9_SCR.
*/
#define	SENT_SCR9	(SENT_CH9_SCR)

/** \brief  350, Serial Data and Status Register */
#define SENT_CH9_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003350u)

/** Alias (User Manual Name) for SENT_CH9_SDS.
* To use register names with standard convension, please use SENT_CH9_SDS.
*/
#define	SENT_SDS9	(SENT_CH9_SDS)

/** \brief  35C, Receive Data View Register */
#define SENT_CH9_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000335Cu)

/** Alias (User Manual Name) for SENT_CH9_VIEW.
* To use register names with standard convension, please use SENT_CH9_VIEW.
*/
#define	SENT_VIEW9	(SENT_CH9_VIEW)

/** \brief  374, Watch Dog Timer Register */
#define SENT_CH9_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003374u)

/** Alias (User Manual Name) for SENT_CH9_WDT.
* To use register names with standard convension, please use SENT_CH9_WDT.
*/
#define	SENT_WDT9	(SENT_CH9_WDT)

/** \brief  0, Clock Control Register */
#define SENT_CLC /*lint --e(923)*/ (*(volatile Ifx_SENT_CLC*)0xF0003000u)

/** \brief  C, SENT Fractional Divider Register */
#define SENT_FDR /*lint --e(923)*/ (*(volatile Ifx_SENT_FDR*)0xF000300Cu)

/** \brief  8, Module Identification Register */
#define SENT_ID /*lint --e(923)*/ (*(volatile Ifx_SENT_ID*)0xF0003008u)

/** \brief  14, Interrupt Overview Register */
#define SENT_INTOV /*lint --e(923)*/ (*(volatile Ifx_SENT_INTOV*)0xF0003014u)

/** \brief  F4, Kernel Reset Register 0 */
#define SENT_KRST0 /*lint --e(923)*/ (*(volatile Ifx_SENT_KRST0*)0xF00030F4u)

/** \brief  F0, Kernel Reset Register 1 */
#define SENT_KRST1 /*lint --e(923)*/ (*(volatile Ifx_SENT_KRST1*)0xF00030F0u)

/** \brief  EC, Kernel Reset Status Clear Register */
#define SENT_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_KRSTCLR*)0xF00030ECu)

/** \brief  E8, OCDS Control and Status */
#define SENT_OCS /*lint --e(923)*/ (*(volatile Ifx_SENT_OCS*)0xF00030E8u)

/** \brief  80, Receive Data Register */
#define SENT_RDR0 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003080u)

/** \brief  84, Receive Data Register */
#define SENT_RDR1 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003084u)

/** \brief  88, Receive Data Register */
#define SENT_RDR2 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003088u)

/** \brief  8C, Receive Data Register */
#define SENT_RDR3 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF000308Cu)

/** \brief  90, Receive Data Register */
#define SENT_RDR4 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003090u)

/** \brief  94, Receive Data Register */
#define SENT_RDR5 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003094u)

/** \brief  98, Receive Data Register */
#define SENT_RDR6 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003098u)

/** \brief  9C, Receive Data Register */
#define SENT_RDR7 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF000309Cu)

/** \brief  A0, Receive Data Register */
#define SENT_RDR8 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030A0u)

/** \brief  A4, Receive Data Register */
#define SENT_RDR9 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030A4u)

/** \brief  A80, Receive Time Stamp Register */
#define SENT_RTS0 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A80u)

/** \brief  A84, Receive Time Stamp Register */
#define SENT_RTS1 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A84u)

/** \brief  A88, Receive Time Stamp Register */
#define SENT_RTS2 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A88u)

/** \brief  A8C, Receive Time Stamp Register */
#define SENT_RTS3 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A8Cu)

/** \brief  A90, Receive Time Stamp Register */
#define SENT_RTS4 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A90u)

/** \brief  A94, Receive Time Stamp Register */
#define SENT_RTS5 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A94u)

/** \brief  A98, Receive Time Stamp Register */
#define SENT_RTS6 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A98u)

/** \brief  A9C, Receive Time Stamp Register */
#define SENT_RTS7 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A9Cu)

/** \brief  AA0, Receive Time Stamp Register */
#define SENT_RTS8 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA0u)

/** \brief  AA4, Receive Time Stamp Register */
#define SENT_RTS9 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA4u)

/** \brief  1C, Time Stamp Predivider Register */
#define SENT_TPD /*lint --e(923)*/ (*(volatile Ifx_SENT_TPD*)0xF000301Cu)

/** \brief  18, Time Stamp Register */
#define SENT_TSR /*lint --e(923)*/ (*(volatile Ifx_SENT_TSR*)0xF0003018u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSENT_REG_H */
